/*
1. Напишете заявка, която извежда номер на модел, честота на процесора (speed) и размер на диска (hd) за всички компютри с цена по-малка от 1200 долара. 
Задайте псевдоними за атрибутите честота и размер на диска, съответно MHz и GB

2. Напишете заявка, която извежда моделите и цените в евро на всички лаптопи. Нека приемем, че в базата цените се съхраняват в долари, а курсът е 1.1 долара за евро. 
Да се изведат първо най-евтините лаптопи

3.Напишете заявка, която извежда номер на модел, размер на паметта, размер на екран за лаптопите, чиято цена е по-голяма от 1000 долара

4.Напишете заявка, която извежда всички цветни принтери

5.Напишете заявка, която извежда номер на модел, честота и размер на диска за тези компютри с DVD 12x или 16x и цена по-малка от 2000 долара

6.Нека рейтингът на един лаптоп се определя по следната формула: честота на процесора + размер на RAM паметта + 10*размер на екрана. 
Да се изведат кодовете, моделите и рейтингите на всички лаптопи.

7.Резултатът да бъде подреден така, че първо да бъдат лаптопите с най-висок рейтинг, а продукти с еднакъв рейтинг да бъдат подредени по код.

*/

SELECT MODEL, SPEED AS MHz, HD as GB
FROM LAPTOP
WHERE PRICE <= 1200

SELECT PRICE * 1.1 AS PRICE_EURO
FROM LAPTOP
ORDER BY PRICE_EURO ASC

SELECT MODEL, HD, SCREEN
FROM LAPTOP
WHERE PRICE >= 1000

SELECT *
FROM PRINTER
WHERE COLOR = 'y'

SELECT * 
FROM PC

SELECT MODEL, SPEED, HD
FROM PC
WHERE (CD = '12x' or CD = '16x')
	and PRICE <= 2000

SELECT CODE, MODEL, (SPEED + HD + 10*SCREEN) AS RATING
FROM LAPTOP

SELECT CODE, MODEL, (SPEED + HD + 10*SCREEN) AS RATING
FROM LAPTOP
ORDER BY RATING DESC, CODE ASC