--Напишете заявка, която извежда номер на модел, честота на процесора (speed) и размер на диска (hd) за всички компютри с цена по-малка от 1200 долара.
--Задайте псевдоними за атрибутите честота и размер на диска, съответно MHz и GB
use pc

select speed as MHz, hd as GB
from pc
where price <= 1200

--Напишете заявка, която извежда моделите и цените в евро на всички лаптопи. Нека приемем, че в базата цените се съхраняват в долари, а курсът е 1.1 долара за евро. 
--Да се изведат първо най-евтините лаптопи
select model, (price / 1.1) as euro
from laptop
order by price asc

--Напишете заявка, която извежда номер на модел, размер на паметта, размер на екран за лаптопите, чиято цена е по-голяма от 1000 долара
select model, hd, screen 
from laptop
where price >= 1000

--Напишете заявка, която извежда всички цветни принтери
select *
from printer
where color = 'y'

--Напишете заявка, която извежда номер на модел, честота и размер на диска за тези компютри с DVD 12x или 16x и цена по-малка от 2000 долара
select model, speed, hd 
from pc
where (cd = '12x' or cd = '16x') and price <= 20000

--Нека рейтингът на един лаптоп се определя по следната формула: честота на процесора + размер на RAM паметта + 10*размер на екрана. Да се изведат кодовете,
--моделите и рейтингите на всички лаптопи.
select code, model, (speed + hd + 10*screen) as rating
from laptop

--Резултатът да бъде подреден така, че първо да бъдат лаптопите с най-висок рейтинг, а продукти с еднакъв рейтинг да бъдат подредени по код.
select code, model, (speed + hd + 10*screen) as rating
from laptop
order by rating, code desc