--Нека рейтингът на един лаптоп се определя по следната формула: честота на процесора + размер на RAM паметта + 10*размер на екрана. 
--Да се изведат кодовете, моделите и рейтингите на всички лаптопи.
SELECT CODE, MODEL, RATING = SPEED + RAM + 10*SCREEN
FROM LAPTOP

--Резултатът да бъде подреден така, че първо да бъдат лаптопите с най-висок рейтинг, а продукти с еднакъв рейтинг да бъдат подредени по код.
SELECT CODE, MODEL, RATING = SPEED + RAM + 10*SCREEN
FROM LAPTOP 
ORDER BY RATING DESC, CODE DESC