-- 1. За всяка филмова звезда да се изведе името, рождената дата и с кое
--    студио е записвала най-много филми. (Ако има две студиа с еднакъв 
--    брой филми, да се изведе кое да е от тях)

-- 2. Да се изведат всички производители, за които средната цена на 
--    произведените компютри е по-ниска от средната цена на техните лаптопи.
USE pc

SELECT p.maker
FROM PRODUCT p JOIN PC pc ON p.model = pc.model
GROUP BY p.maker
HAVING AVG(pc.price) < (SELECT AVG(l.price) 
						FROM product p2 JOIN LAPTOP l ON p2.model = l.model
						WHERE p2.maker = p.maker)

-- 3. Един модел компютри може да се предлага в няколко конфигурации 
--    с евентуално различна цена. Да се изведат тези модели компютри,
--    чиято средна цена (на различните му конфигурации) е по-ниска
--    от най-евтиния лаптоп, произвеждан от същия производител.
USE pc

SELECT pc.model
FROM PC pc JOIN PRODUCT p ON pc.model = p.model
GROUP BY pc.MODEL, p.MAKER
HAVING AVG(pc.price) < (SELECT AVG(l.price)
						FROM PRODUCT p2 JOIN LAPTOP l ON p2.model = l.model
						WHERE p2.maker = p.maker)

-- 4. Битките, в които са участвали поне 3 кораба на една и съща страна.

-- 5. За всеки кораб да се изведе броят на битките, в които е бил увреден.
--    Ако корабът не е участвал в битки или пък никога не е бил
--    увреждан, в резултата да се вписва 0.

-- 6. За всеки клас да се изведе името, държавата и първата година, в която 
--    е пуснат кораб от този клас

-- 7. За всяка държава да се изведе броят на корабите и броят на потъналите 
--    кораби. Всяка от бройките може да бъде и нула.

-- 8. Намерете за всеки клас с поне 3 кораба броя на корабите от 
--    този клас, които са с резултат ok.

-- 9. За всяка битка да се изведе името на битката, годината на 
--    битката и броят на потъналите кораби, броят на повредените
--    кораби и броят на корабите без промяна.

-- 10. Да се изведат имената на корабите, които са участвали в битки в
--     продължение поне на две години.

-- 11. За всеки потънал кораб колко години са минали от пускането му на вода 
--     до потъването.

-- 12. Имената на класовете, за които няма кораб, пуснат на вода след 1921 г., 
--     но имат пуснат поне един кораб. 